clc
global ro pn p ak hg g s
np=12; nk=8; nv=17; s=[1,1,1]; g=9.815;
disp ('Высота емкостей'); hg=[10,10,10];
disp ('плотность (кг/м3)'); ro=1000;
disp ('Начальное давление (Па)'); pn=100000;
disp ('Площадь внутреннего проходного сечения трубопровода (м^2)'); S=0.01;
disp ('Давление (1-6 известны, 7-12 считаются)');
p=[1000000, 1000000, 100000, 100000, 100000, 100000, 0, 0, 0, 0, 0, 0];
disp ('Коэф. пропускной способности (1-8)'); k=[0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01, 0.01];
t0=0; tk=10000; dt=1;
t=[t0:dt:tk];
H10=0; H20=0; H30=0;
Y0=[H10;H20;H30];
for i=1:length(k)
ak(i)=k(i)*S/sqrt(ro);
end
[T,Y]=ode45(@fpr,t,Y0);
plot(T,Y(:,1),'r.:')
hold on
plot(T,Y(:,2),'y.:')
plot(T,Y(:,3),'k.:')
title('Solver gidravlika-dinamika, variant 4')
xlabel('\itt')
ylabel('{\ith1}, {\ith2}, {\ith3}')
legend('h1','h2','h3')
hold off
disp('Завершение моделирования')
